Repository: sergev/mcprog
Catalog: trunk/mcprog-*.po
Languages: ru

source: %s: read error
ru: %s: ошибка чтения

source: %s: bad file format
ru: %s: неверный формат файла

source: %s: bad record: %s
ru: %s: некорректная строка: %s

source: %s: incorrect address %08X, must be %08X or greater
ru: %s: некорректный адрес %08X, должен быть %08X или больше

source: %s: address too large: %08X + %08X
ru: %s: слишком большой адрес: %08X + %08X

source: Board serial number: %s
ru: Серийный номер вычислителя: %s

source: Software version: %s
ru: Версия программного обеспчения: %s

source: Software file name: %s
ru: Имя файла: %s

source: Date of creation: %02d.%02d.%04d
ru: Дата создания: %02d.%02d.%04d

source: Memory size: %d
ru: Размер: %d

source: CRC: %08X
ru: Контрольная сумма: %08X

source: No information
ru: Нет информации

source: read word %08X at address %08X
ru: прочитано слово %08X по адресу %08X

source: error at address %08X: file=%08X, mem=%08X
ru: ошибка по адресу %08X: в файле=%08X, в памяти=%08X

source: Flash at %08X:
ru: Флеш-память %08X:

source: Incorrect id %08X
ru: Неверный идентификатор %08X

source: , %d Mbytes, %d bit wide
ru: , %d Мбайт, ширина: %d

source: , %d kbytes, %d bit wide
ru: , %d кбайт, ширина: %d

source: Start: %08X
ru: Стартовый адрес: %08X

source: Board: %s
ru: Тип бортового вычислителя: %s

source: %s: unknown parameter `%s'
ru: %s: неизвестный параметр `%s'

source: %s: parameter 'default' missing
ru: %s: не найден параметр 'default'

source: %s: incorrect value for parameter `%s'
ru: %s: неправильное значение для параметра `%s'

source: %s: out of memory
ru: %s: недостаточно памяти

source: Error detecting device -- check cable!
ru: Не найдено устройство - проверьте кабель!

source: Processor: %s (id %08X)
ru: Процессор: %s (идентификатор %08X)

source: Clean flash: %08X
ru: Свободная флеш-память: %08X

source: Memory: %08X-%08X, total %d bytes
ru: Память: %08X-%08X, всего %d байт

source: No software information label found. Did you labeled it with verstamp utility?
ru: Не найдена метка блока информации о ПО. Было ли оно помечено с помощью сервисного ПО?

source: Warning: board number is too large. Must be %d bytes at most. Will be cut
ru: Предупреждение: слишком длинный серийный номер. Он должен быть максимум %d. Будет обрезан до допустимой длины.

source: Loaded software information: ----------------------------
ru: Информация о загруженном программном обеспечении: -------------------------------------------------

source: Processor: %s
ru: Процессор: %s

source: No flash memory detected.
ru: Не найдена флеш-память.

source: Flash: %s %s
ru: Флеш-память: %s %s

source: , size %d Mbytes, %d bit wide
ru: , размер %d Мбайт, ширина: %d

source: , size %d kbytes, %d bit wide
ru: , размер %d кбайт, ширина: %d

source: Verify:
ru: Проверка:

source: Program:
ru: Прошивка:

source: # done
ru: # выполнено

source: Rate: %ld bytes per second
ru: Скорость: %ld байт в секунду

source: Write:
ru: Запись:

source: Flash #%d, address %08X ----------------------------------
ru: Флеш-память #%d, адрес %08X -----------------------------------

source: Programmer for Elvees MIPS32 processors, Version %s
ru: Программатор для процессоров Элвис MIPS32, версия %s

source: Copyright (C) 2010 Serge Vakulenko
ru: Copyright (C) 2010 Сергей Вакуленко

source: write %08x to %08x
ru: запись %08x в %08x

source: Timeout writing memory, aborted. OSCR=%#x
ru: Таймаут при записи памяти, завершение. OSCR=%#x

source: write word %08x to %08x
ru: запись слова %08x в %08x

source: Timeout reading memory, aborted. OSCR=%#x
ru: Таймаут чтения памяти, завершено. OSCR=%#x

source: read %08x from %08x
ru: чтение %08x из %08x

source: Out of memory
ru: Недостаточно памяти

source: No JTAG adapter found.
ru: Не найден адаптер JTAG.

source: No response from device -- check power is on!
ru: Нет ответа от устройства - проверьте, что включено питание!

source: No response from device -- unknown idcode 0x%08X!
ru: Нет ответа от устройства - неизвестный idcode 0x%08X!

source: target_flash_configure: too many flash regions.
ru: target_flash_configure: слишком много областей флеш-памяти.

source: target: no flash region for address 0x%08X
ru: вычислитель: нет флеш-памяти по адресу 0x%08X

source: flash id %08X
ru: Идентификатор флеш-памяти %08X

source: Unknown flash id = %08X
ru: Неизвестный идентификатор флеш-памяти = %08X

source: Erase: %08X
ru: Стирание: %08X

source: done
ru: выполнено

source: target: cannot rewrite word at %x: good %08x bad %08x
ru: вычислитель: не получается перезаписать слово по адресу %x: верно %08x неверно %08x

source: rewrite word %02x at %08x
ru: перезапись слова %08x по адресу %08x

source: Timeout, writing JTAG DR
ru: Таймаут записи в адаптер JTAG
